/* Recovery options for the errors */
TryAgainButtonTitle = "Spróbuj ponownie";
CancelButtonTitle = "Anuluj";


/*Error descriptions for corrupted store*/
CorruptedEventStoreDescription = "<OPERATION>, ponieważ uszkodzony jest następujący plik: „/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”.";

/*Error descriptions for missing store*/
MissingEventStoreDescription = "<OPERATION>, ponieważ nie można znaleźć następującego pliku: „/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”.";

/*Recovery suggestion for corrupted and missing store.*/
MissingEventStoreRecoverySuggesstion = "Jeśli przeniesiono lub usunięto plik „HPEventStore.hpstore”, umieść go ponownie, a następnie kliknij opcję „Spróbuj ponownie”. Można też utworzyć nowy plik, klikając opcję „Utwórz”.";

/* Recovery options for corrupted and missing store */
CreateButtonTitle = "Utwórz";

/*Error descriptions for permission error*/
EventStorePermissionsErrorDescription = "<OPERATION>, ponieważ aplikacja nie może uzyskać dostępu do następującego pliku: „/Users/Shared/HP/HP Event Store/HPEventStore.hpstore”.";

/* Recovery options for corrupted and missing store */
RepairAccessButtonTitle = "Napraw dostęp";

/*Added new key to refer error recovery suggestion if the permission is not proper.*/
EventStorePermissionsErrorRecoverySuggesstion = "Sprawdź załączone foldery pliku „HPEventStore.hpstore”, aby upewnić się, że nie są zablokowane, a ich uprawnienia są ustawione na „zapis i odczyt”, a następnie kliknij opcję „Spróbuj ponownie”. Jeśli chcesz, aby aplikacja spróbowała naprawić uprawnienia, kliknij opcję „Napraw dostęp”.";

//Error description for out of disk space error
DiskFullErrorDescription = "<OPERATION>, ponieważ brak wystarczającej ilości miejsca na dysku.";

//Recover suggestion for out of disk space error
DiskFullErrorRecoverySuggesstion = "Usuń część plików z woluminu, a następnie kliknij opcję „Spróbuj ponownie”.";
